/*************************************************************************
	> File Name: 6.4.c
	> Author: 
	> Mail: 
	> Created Time: 2020年01月31日 星期五 21时30分09秒
 ************************************************************************/
//   控制行数{
//      控制空格            利用空格数，行数，字母数 列表找出规律
//      控制正序字母
//      控制逆序字母
//      }
#include<stdio.h>
int main(void)
{
    int i,j,k,l;
    for (i=1;i<6;i++)
    {
        for (j = 5 - i;j > 0;j--)
        {
            printf(" ");
        }
        for (k = 0;k < i;k++)
        {
            printf("%c",'A'+k);
        }
        for (l = i-1;l > 0;l--)
        {
            printf("%c",'A'+l-1);
        }
        printf("\n");
    }
}
