/*************************************************************************
	> File Name: 6.7.c
	> Author: 
	> Mail: 
	> Created Time: 2020年01月31日 星期五 22时10分33秒
 ************************************************************************/

#include<stdio.h>
int main(void)
{
    double a,b,c;
    printf("输入数据，计算结果（若想退出程序输入非数字值）：");
    while(scanf("%lf%lf",&a,&b,&c)==2)
    {
        printf("(%.1lf-%.1lf)/%.1lf*%.1lf=%lf\n",a,b,a,b,(a-b)/a*b);
        printf("输入数据，计算结果（若想退出程序输入非数字值）：");
    }
    printf("END\n");
}
